[
  {
    "version": "v2.0.2",
    "date": "February 24, 2026",
    "changes": [
      "Hotfix: Edited Logo name font for darkmode."
    ]
  },
 {
    "version": "v2.0.1",
    "date": "February 24, 2026",
    "changes": [
      "Hotfix: Edited Logo name font."
    ]
  },
  {
    "version": "v1.3.0",
    "date": "February 24, 2026",
    "changes": [
      "Added a Light and Dark Mode theme toggle for better user experience and accessibility. Users can now switch between light and dark themes based on their preference, making the app more visually appealing and easier to use in different lighting conditions.",
      "Updated the app icon to a new design that better represents the brand and enhances the overall look of the application. The new icon provides a fresh and modern appearance, making it more recognizable and appealing to users.",
      "Updated the Design to be more modern and sleek, improving the overall user interface and user experience. The new design features a cleaner layout, improved typography, and a more intuitive navigation system, making it easier for users to interact with the app and access its features."
    ]
  },
      {
    "version": "v1.2.5",
    "date": "February 24, 2026",
    "changes": [
      "Fixed a bug where files failed to upload properly cause of difference in zoom file size and actual downloaded file size."
    ]
  },
    {
    "version": "v1.2.4",
    "date": "February 24, 2026",
    "changes": [
      "Fixed update timer logic."
    ]
  },
  {
    "version": "v1.2.3",
    "date": "February 24, 2026",
    "changes": [
      "Added try and catch logic for small size difference for txt and vtt files",
      "New icon hell yeah!"
    ]
  },
    {
    "version": "v1.2.2",
    "date": "February 22, 2026",
    "changes": [
      "Added a new feature to automatically check for updates every 30 minutes and notify the user when an update is available. This ensures that users always have the latest version of the app with the newest features and bug fixes.",
      "Added a new feature to safely save data to prevent file corruption. This ensures that user data is protected and reduces the risk of losing important information due to unexpected crashes or errors.",
      "Fixed a bug that caused the app to crash when reading clickup brands. This improves the stability of the app and ensures that users can access their clickup brands without any issues."
    ]
  },
  {
    "version": "v1.2.1",
    "date": "February 20, 2026",
    "changes": [
      "Fixed a bug for reading clickup brands"
    ]
  },
  {
    "version": "v1.2.0",
    "date": "February 20, 2026",
    "changes": [
      "Added automatic background Update Checker (30 mins).",
      "Implemented Safe Save to prevent file corruption.",
      "Fixed the apostrophe crash for Zoom names."
    ]
  },
  {
    "version": "v1.1.6",
    "date": "February 20, 2026",
    "changes": [
      "Added Bug Reporter."
    ]
  }
]